In [1]:
import pymysql
from sqlalchemy import create_engine
from getpass import getpass
import pandas as pd

In [2]:
pswd=getpass()

········

In [3]:
engine=create_engine(f'mysql+pymysql://root:{pswd}@localhost/vivino')

#### what food goes with different wine
```mysql
select wine_id, name
from meat_wine mw
inner join meat_info mi
on mw.food_id=mi.id;
```

In [4]:
pd.read_sql_query("""select wine_id, name
from meat_wine mw
inner join meat_info mi
on mw.food_id=mi.id;""", engine)

      wine_id                      name
0     1163903                      Bœuf
1     1163903                    Agneau
2     1163903                      Veau
3     1163903                  Volaille
4        1873                      Bœuf
...       ...                       ...
3141  1143692  Gibier (cerf, chevreuil)
3142  1622868                      Bœuf
3143  1622868                    Agneau
3144  1622868  Gibier (cerf, chevreuil)
3145  1622868                  Volaille

[3146 rows x 2 columns]

In [5]:
mw=pd.read_sql_table('meat_wine', engine)
mi=pd.read_sql_table('meat_info', engine)

In [9]:
mw.merge(mi, left_on='food_id', right_on='id', how='inner')[['wine_id','name']]

      wine_id      name
0     1163903      Bœuf
1        1873      Bœuf
2        4848      Bœuf
3        7773      Bœuf
4        4113      Bœuf
...       ...       ...
3141    15098  Apéritif
3142  1230950  Apéritif
3143  1210421  Apéritif
3144  1230960  Apéritif
3145    88870  Apéritif

[3146 rows x 2 columns]

```mysql
select wine_id, group_concat(distinct name)
from meat_wine mw
inner join meat_info mi
on mw.food_id=mi.id
group by wine_id;
```

In [11]:
joined_table=mw.merge(mi, left_on='food_id', right_on='id', how='inner')

In [19]:
joined_table.groupby('wine_id').name.apply(lambda x: ', '.join(set(x))).reset_index()

     wine_id                                               name
0       1241                             Bœuf, Volaille, Agneau
1       1244   Bœuf, Gibier (cerf, chevreuil), Volaille, Agneau
2       1245   Bœuf, Gibier (cerf, chevreuil), Volaille, Agneau
3       1249  Porc, Poisson gras (saumon, thon, etc.), Volai...
4       1251                             Bœuf, Volaille, Agneau
..       ...                                                ...
787  6514155                                Pâtes, Bœuf, Agneau
788  6689232     Veau, Bœuf, Gibier (cerf, chevreuil), Volaille
789  7199473           Fromage de chèvre, Végétarien, Crustacés
790  7311113                       Veau, Bœuf, Volaille, Agneau
791  7334207                      Pâtes, Bœuf, Volaille, Agneau

[792 rows x 2 columns]

```mysql
select wine_id, group_concat(distinct name), count(distinct name)
from meat_wine mw
inner join meat_info mi
on mw.food_id=mi.id
group by wine_id
order by 3 desc
limit 10;
```

In [26]:
joined_table.groupby('wine_id').name.agg(['nunique',lambda x: ', '.join(set(x))])

         nunique                                         <lambda_0>
wine_id
1241           3                             Bœuf, Volaille, Agneau
1244           4   Bœuf, Gibier (cerf, chevreuil), Volaille, Agneau
1245           4   Bœuf, Gibier (cerf, chevreuil), Volaille, Agneau
1249           4  Porc, Poisson gras (saumon, thon, etc.), Volai...
1251           3                             Bœuf, Volaille, Agneau
...          ...                                                ...
6514155        3                                Pâtes, Bœuf, Agneau
6689232        4     Veau, Bœuf, Gibier (cerf, chevreuil), Volaille
7199473        3           Fromage de chèvre, Végétarien, Crustacés
7311113        4                       Veau, Bœuf, Volaille, Agneau
7334207        4                      Pâtes, Bœuf, Volaille, Agneau

[792 rows x 2 columns]

```mysql
select count(wine_id)
from wine
group by type;
#3392 vs 208
select type, count(distinct wine_id)
from wine
group by type;
#690 vs 104
```

In [27]:
wine=pd.read_sql_table('wine', engine)

In [28]:
wine.type.value_counts()

Red      3392
White     208
Name: type, dtype: int64

In [33]:
wine.groupby('wine_id').type.unique().apply(lambda x: x[0]).value_counts()

Red      690
White    104
Name: type, dtype: int64

In [36]:
wine.drop_duplicates(subset='wine_id').type.value_counts()

Red      690
White    104
Name: type, dtype: int64

In [38]:
wine.groupby('type').wine_id.nunique()

type
Red      690
White    104
Name: wine_id, dtype: int64

```mysql
#how many datapoints do we have per country
select country, count(distinct wine_id)
from wine
group by country
order by 2 desc;
```

In [42]:
wine.groupby('country').wine_id.nunique().sort_values(ascending=False)

country
France              470
Italie              166
Espagne              64
États-Unis           27
Chili                15
Australie            15
Argentine            13
Nouvelle-Zélande     10
Allemagne             5
Liban                 4
Afrique du Sud        3
Portugal              1
Name: wine_id, dtype: int64

In [47]:
wine.loc[wine.country.isna(), 'country']='China'

In [48]:
wine.loc[wine.country.isna(), 'country']

Series([], Name: country, dtype: object)

In [49]:
wine.groupby('country').wine_id.nunique().sort_values(ascending=False)

country
France              470
Italie              166
Espagne              64
États-Unis           27
Chili                15
Australie            15
Argentine            13
Nouvelle-Zélande     10
Allemagne             5
Liban                 4
Afrique du Sud        3
Portugal              1
China                 1
Name: wine_id, dtype: int64

```mysql
select w.country, round(avg(price),2) as price, round(max(price),2) as maxprice, round(min(price),2) as minprice
from prices p
inner join vintages v on p.vintage_id=v.id
inner join wine w on v.wine_id=w.wine_id
group by w.country
order by 4 desc;
```

In [50]:
prices=pd.read_sql_table('prices', engine)
vintages=pd.read_sql_table('vintages', engine)

In [54]:
joined_table=prices.merge(vintages, left_on='vintage_id', right_on='id').merge(wine, on='wine_id')

In [66]:
joined_table[['country', 'price']].groupby('country').price.describe().round(2)

count    172947.00
mean        105.07
std          71.13
min           3.75
25%          51.18
50%          92.00
75%         139.20
max         820.00
Name: price, dtype: float64

Top 10 wines in France with highest rating, lowest price

In [81]:
url="https://www.seloger.com/list/api/externaldata?from=25&size=25&isSeo=false"
https://www.seloger.com/list/api/externaldata?from=50&size=25&isSeo=false

In [93]:
headers="""accept: application/json
accept-encoding: gzip, deflate, br
accept-language: en-US,en;q=0.9,ru;q=0.8,fr;q=0.7
cache-control: no-cache
content-length: 1303
content-type: application/json
cookie: didomi_token=eyJ1c2VyX2lkIjoiMTc3YTZhZjMtOWRkNy02OTA3LThlNTUtNjE1YWU4ODJiN2IyIiwiY3JlYXRlZCI6IjIwMjEtMDItMTVUMTc6MTM6NTkuNTQ5WiIsInVwZGF0ZWQiOiIyMDIxLTAyLTE1VDE3OjEzOjU5LjU0OVoiLCJ2ZW5kb3JzIjp7ImVuYWJsZWQiOlsiZmFjZWJvb2siLCJnb29nbGUiLCJjOm9tbml0dXJlLWFkb2JlLWFuYWx5dGljcyIsImM6aGFydmVzdC1QVlRUdFVQOCIsImM6ZmFjZWJvb2stYnRDNFpXNnIiXX0sInB1cnBvc2VzIjp7ImVuYWJsZWQiOlsiYW5hbHlzZWRlLVZEVFVVaG42Iiwic29jaWFsIiwiZGV2aWNlX2NoYXJhY3RlcmlzdGljcyIsImdlb2xvY2F0aW9uX2RhdGEiXX0sInZlbmRvcnNfbGkiOnsiZW5hYmxlZCI6WyJnb29nbGUiXX0sInZlcnNpb24iOjIsImFjIjoiQWt1QUNBa3MuQWt1QUNBa3MifQ==; euconsent-v2=CPBqrZrPBqrZrAHABBENBNCsAP_AAH_AAAAAHZtf_X_fb3_j-_59_9t0eY1f9_7_v-0zjhfds-8Nyf_X_L8X42M7vF36pq4KuR4Eu3LBIQdlHOHcTUmw6okVrTPsbk2Mr7NKJ7PEinMbe2dYGH9_n9XTuZKY79_s___z__-__v__7_f_r-3_3_vp9X---_e_V399gdmASYal8BFmJY4Ek0aVQogQhXEh0AoAKKEYWiawgJXBTsrgI9QQMAEBqAjAiBBiCjFgEAAAAASURASAHggEQBEAgABACpAQgAI0AQWAFgYBAAKAaFgBFAEIEhBkcFRymBARItFBPJWAJRd7GGEIZRYAUCj-iowESAAA.f_gAD_gAAAAA; visitId=1613409239615-246908045; _ga=GA1.2.1591795723.1613409240; _gid=GA1.2.489438709.1614006763; __gads=ID=60f7e756d4fda040:T=1614006761:S=ALNI_MbMz6c7A2Plf3JmrOIZUkHjuvH2_A; datadome=0Q_IMrS1Fdf-V-G91wvV0IHAYpXGpIW1FDXjqDgixzmr6_hqIfnfHMbrJk00Bomk8Xz0JZb~6quajf63nVy9LVtZ6g4X_NXYcz2qOBq~KK
dnt: 1
origin: https://www.seloger.com
pragma: no-cache
referer: https://www.seloger.com/list.htm?projects=2%2C5&types=2%2C1&natures=1%2C2%2C4&places=%5B%7B%22divisions%22%3A%5B2238%5D%7D%5D&enterprise=0&qsVersion=1.0&LISTING-LISTpg=2
sec-fetch-dest: empty
sec-fetch-mode: cors
sec-fetch-site: same-origin
user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.141 Safari/537.36 OPR/73.0.3856.400"""

In [94]:
headers=dict(i.split(': ') for i in headers.split('\n'))

In [98]:
data="""{"projects":[2,5],"types":[2,1],"natures":[1,2,4],"places":[{"countries":null,"divisions":[2238],"subDivisions":null,"postalCodes":null,"inseeCodes":null,"districts":null,"label":"Île-de-France","hasCountries":false,"hasDivisions":true,"hasSubDivisions":false,"hasPostalCodes":false,"hasInseeCodes":false,"hasCities":false,"hasDistricts":false}],"searchAreas":null,"isochronePoints":null,"proximities":null,"geoloc":null,"geoPrecision":null,"pointOfInterests":null,"geoZone":null,"price":null,"groundSurface":null,"surface":null,"bedrooms":[],"rooms":[],"bedroom":null,"room":null,"sort":[],"floor":null,"mandatoryCommodities":null,"lastFloor":null,"hearth":null,"guardian":null,"view":null,"balcony":null,"pool":null,"lift":null,"terrace":null,"cellar":null,"south":null,"parking":null,"box":null,"parquet":null,"locker":null,"furnished":null,"disabledAccess":null,"alarm":null,"toilet":null,"bathtub":null,"shower":null,"hall":null,"livingRoom":null,"diningRoom":null,"kitchen":null,"heating":null,"unobscured":null,"picture":null,"exclusiveness":null,"priceChange":null,"privateSeller":null,"video":null,"vv":null,"enterprise":false,"garden":null,"garage":null,"basement":null,"groundFloor":null,"intercom":null,"digicode":null,"since":null,"houseboat":null,"textCriteria":null,"idPublication":null}"""

In [99]:
import requests as r

In [100]:
r.post(url, headers=headers, data=data).content

b'{"type":"https://tools.ietf.org/html/rfc7231#section-6.5.1","title":"One or more validation errors occurred.","status":400,"traceId":"|d1d64eda-4f124a0e6e5aa1d8.","errors":{"$.places[0].label":["The JSON value could not be converted to System.String. Path: $.places[0].label | LineNumber: 0 | BytePositionInLine: 194."]}}'